HELYXcore-4.4.0/examples/legacy/lagrangian/reactingParcelFoam/parcelInBox/0/G
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    walls
    {
        type            MarshakRadiation;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            MarshakRadiation;
        emissivity      uniform 1.0;
        value           uniform 0;
    }
}


// ************************************************************************* //
